app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "aaa"], ["email", "aaa"], ["created_at", "2022-11-09 08:45:50.892197"], ["updated_at", "2022-11-09 08:45:50.892197"]]

  def update
    @user = User.find(params[:id])
    @user = User.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "aa"], ["email", "aa"], ["updated_at", "2022-11-09 09:10:55.476872"], ["id", 4]]